import React, { useState, useRef } from "react";
import { Container, Row, Col } from "react-bootstrap";
import ModalPart from "../ModalPart/ModalPart";
import { motion, useInView } from "framer-motion";
import ArrowBackIcon from "@mui/icons-material/ArrowBack";
import "./Services.css";
export default function Services() {
  const aboutMe = [
    {
      id: 1,
      howToWork: "طراح وب",
      img: "images/serviseModal/wp6784617.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
    {
      id: 2,
      howToWork: "طراح رابط کاربری",
      img: "images/experinceModal/thumb-1920-1338701.png",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
    {
      id: 3,
      howToWork: "برنامک موبایل",
      img: "images/serviseModal/poco-x5-19-1690829815356.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
    {
      id: 4,
      howToWork: "سرچ کنسول",
      img: "images/serviseModal/search-console-regex-creativerace-1.webp",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
    {
      id: 5,
      howToWork: "انیمیشن",
      img: "images/serviseModal/RL_magazine_1920x1080.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
    {
      id: 6,
      howToWork: "بازی سازی",
      img: "images/serviseModal/1920-x-1080-hd-gaming-buu1xho2onmsr8rf.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "توسعه وب، فرآیند ساختن، برنامه نویسی...",
    },
  ];
  const ref = useRef(null);
  const isInView = useInView(ref, { once: false });

  const ref1 = useRef(null);
  const isInView1 = useInView(ref1, { once: false });

  const [isShowModal, setIsShowModal] = useState(false);
  const [selectItem, setSelectItem] = useState([]);

  return (
    <>
      <motion.div ref={ref} className="py-5 md:py-14 lg:py-20 xl:py-28">
        <motion.div
          style={{
            opacity: isInView ? 1 : 0,
            translateY: isInView ? 0 : -50,
            transition: "all 0.9s cubic-bezier(0.17, 0.55, 0.55, 1) 0.5s ",
          }}
        >
          <div className="space-y-6 px-4 md:px-6 lg:px-10 xl:px-28  mb-10">
            <span className="text-3xl text-stone-600">- خدمات</span>
            <h3 className="text-4xl font-bold tracking-wide text-stone-900">
              خدمات من
            </h3>
          </div>
          <Container fluid className="px-4 md:px-6 lg:px-10 xl:px-28">
            <Row>
              {aboutMe.map((item) => (
                <>
                  <Col className="mb-4" key={item.id} xs={12} md={6} xxl={4}>
                    <motion.div
                      whileHover={{
                        translateY: -10,
                      }}
                      whileTap={{
                        scale: 0.8,
                      }}
                      style={{
                        rotate: isInView ? 0 : 120,
                        translateX: isInView ? 0 : 50,
                      }}
                      onClick={() => {
                        setIsShowModal(true);
                        setSelectItem(item);
                      }}
                      className="bg-white rounded-[5px] px-[70px] py-[45px] border "
                    >
                      <p className="text-2xl text-slate-500 font-bold mb-3">
                        {item.id}
                      </p>

                      <h4 className="mb-3 text-2xl font-bold tracking-wide">
                        {item.howToWork}
                      </h4>
                      <p className="text-xl text-slate-500">{item.titleCard}</p>
                      <div className="flex items-center mt-3">
                        <p className="text-xl ml-5">بیشتر بخوانید</p>
                        <ArrowBackIcon />
                      </div>
                    </motion.div>
                  </Col>
                </>
              ))}
            </Row>
          </Container>
        </motion.div>
      </motion.div>{" "}
      <Container>
        <Row>
          <Col>
            <motion.div
              ref={ref1}
              style={{
                opacity: isInView1 ? 1 : 0,
                transition: "all 0.9s cubic-bezier(0.17, 0.55, 0.55, 1) .5s ",
              }}
            >
              <div class="h_iframe-aparat_embed_frame">
                <span style={{ display: "block", paddingTop: "57%" }}></span>
                <iframe
                  src="https://www.aparat.com/video/video/embed/videohash/hRItr/vt/frame?titleShow=true"
                  allowFullScreen="true"
                  webkitallowfullscreen="true"
                  mozallowfullscreen="true"
                ></iframe>
              </div>
            </motion.div>
          </Col>
        </Row>
      </Container>
      {isShowModal && (
        <ModalPart
          {...selectItem}
          isShowModal={isShowModal}
          setIsShowModal={setIsShowModal}
        />
      )}
    </>
  );
}
