import React, { useRef, useState } from "react";
import { Col, Container, Row } from "react-bootstrap";
import { motion, useInView } from "framer-motion";
import ModalPart from "../ModalPart/ModalPart";
import ArrowBackIcon from "@mui/icons-material/ArrowBack";

export default function WebLog() {
  const webLogsModal = [
    {
      id: 1,
      time: "12 فروردین، 1402",
      img: "images/weblog/5faec67ee8b4011bf46af22f28c6f1f6.png",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "12 نمونه پروژه قالب شخصی",
    },
    {
      id: 2,
      time: "1 خرداد، 1402",
      img: "images/weblog/covid-corona-hjartproblem.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "مقابله با علائم آلرژی بهاری",
    },
    {
      id: 3,
      time: "30 خرداد، 1402",
      img: "images/weblog/wake_up_190412.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "چرا باید کمتر کتاب بخوانیم",
    },
    {
      id: 4,
      time: "1401 تا 1402",
      img: "images/weblog/o-que-e-web-design.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "مهارت ها و ابزارهای کارآمد طراحی وب",
    },
    {
      id: 5,
      time: "10 مهر، 1402",
      img: "images/weblog/python-coding-mistakes.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "نحوه استفاده از پایتون برای خراش دادن وب",
    },
    {
      id: 6,
      time: "11 مهر، 1402",
      img: "images/weblog/1677088482093.png",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "بهترین ابزار های طراحی وب",
    },
    {
      id: 7,
      time: "1 آبان، 1402",
      img: "images/weblog/The-Highest-Grossing-Animated-Films-at-The-Box-Office-Photo-Gallery.webp",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard: "چرا ما دیوانه انیمیشن ها هستیم",
    },
  ];
  const [isShowModal, setIsShowModal] = useState(false);
  const [selectItem, setSelectItem] = useState([]);
  const ref = useRef(null);
  const isInView = useInView(ref, { once: false });
  return (
    <>
      <div className="overflow-hidden">
        <motion.div className="my-28" ref={ref}>
          <Container fluid>
            <Row>
              <Col xs={12} md={4}>
                <motion.div
                  style={{
                    opacity: isInView ? 1 : 0,
                    translateX: isInView ? 0 : 50,
                    transition:
                      "all 0.9s cubic-bezier(0.17, 0.55, 0.55, 1) 1s ",
                  }}
                  className="space-y-6 mb-24"
                >
                  <span className="text-3xl text-stone-600">- وبلاگ</span>
                  <h3 className="text-4xl font-bold tracking-wide text-stone-900">
                    وبلاگ و اخبار من
                  </h3>
                  <motion.button
                    whileHover={{ scale: 1.1 }}
                    whileTap={{ scale: 0.9 }}
                    transition={{ type: "spring", stiffness: 400, damping: 17 }}
                    className="bg-blue-950 text-white py-[9px] px-10 rounded-md text-lg tracking-wide ml-4 hover:bg-transparent mt-5  hover:!text-slate-600 border-2"
                  >
                    پروژه ای دارید؟
                  </motion.button>
                </motion.div>
              </Col>
              <Col xs={12} md={8}>
                {webLogsModal.map((webLog, index) => (
                  <motion.div
                    style={{
                      opacity: isInView ? 1 : 0,
                      translateX: isInView ? 0 : -50,
                      transition: `all 0.9s cubic-bezier(0.17, 0.55, 0.55, 1) ${
                        index * 0.5 + 0.1
                      }s `,
                    }}
                    onClick={() => {
                      setIsShowModal(true);
                      setSelectItem(webLog);
                    }}
                    className="flex items-center justify-between p-4 cursor-pointer"
                  >
                    <div>
                      <div className="text-gray-600 text-xl font-semibold mb-3">
                        <h3 className="">{webLog.time}</h3>
                      </div>
                      <div>
                        <p className="text-3xl font-semibold  text-blue-950">
                          {webLog.titleCard}
                        </p>
                      </div>
                    </div>
                    <div className="mt-3 flex items-center">
                      <p className="text-2xl ml-5">بیشتر بخوانید</p>
                      <span>
                        {" "}
                        <ArrowBackIcon />
                      </span>
                    </div>
                  </motion.div>
                ))}
              </Col>
            </Row>
          </Container>
        </motion.div>
      </div>
      {isShowModal && (
        <ModalPart
          {...selectItem}
          isShowModal={isShowModal}
          setIsShowModal={setIsShowModal}
        />
      )}
    </>
  );
}
