import React, { useState, useRef } from "react";
import { Container, Row, Col } from "react-bootstrap";
import ModalPart from "../ModalPart/ModalPart";
import { motion, useInView } from "framer-motion";
export default function Experience() {
  const aboutMe = [
    {
      id: 1,
      time: "1402 تا الان",
      company: "انواتو مارکت",
      howToWork: "طراح وب",
      img: "images/experinceModal/Laptop-Work-Condition-1920x1200.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard:
        "توسعه وب سایت فرآیند ساخت، برنامه نویسی، کدنویسی و نگهداری وب سایت ها و برنامه های کاربردی وب است.",
    },
    {
      id: 2,
      time: "1401 تا 1402",
      company: "استودیو پروا",
      howToWork: "طراح وب",
      img: "images/experinceModal/laptop_cup_glasses_114948_1920x1080.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard:
        "توسعه وب سایت فرآیند ساخت، برنامه نویسی، کدنویسی و نگهداری وب سایت ها و برنامه های کاربردی وب است.",
    },
    {
      id: 3,
      time: "1399 تا 1400",
      company: "کالرلیب",
      howToWork: "طراح تجربه کاربری",
      img: "images/experinceModal/laptop-murjp1nk4lp1idlt.jpg",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard:
        "توسعه وب سایت فرآیند ساخت، برنامه نویسی، کدنویسی و نگهداری وب سایت ها و برنامه های کاربردی وب است.",
    },
    {
      id: 4,
      time: "1397 تا 1399",
      company: "ویو کاب",
      howToWork: "فریلنسر",
      img: "images/experinceModal/thumb-1920-1338701.png",
      textModalP3:
        "به همین دلیل است که شرکت‌های بیشتری نه تنها طراحی وب‌سایت خود را مورد ارزیابی مجدد قرار می‌دهند، بلکه با Elisc، آژانس طراحی وب که بیش از 2.4 میلیارد دلار درآمد برای مشتریان خود دارد، شریک می‌شوند. با بیش از 50 جایزه طراحی وب، ما مطمئن هستیم که می توانیم یک وب سایت سفارشی طراحی کنیم که فروش را برای کسب و کار منحصر به فرد شما افزایش دهد.",
      textModalP2:
        "در دنیای دیجیتال امروزی، وب سایت شما اولین تعاملی است که مصرف کنندگان با کسب و کار شما دارند. به همین دلیل است که تقریباً 95 درصد از اولین برداشت کاربر مربوط به طراحی وب است. همچنین به همین دلیل است که خدمات طراحی وب سایت می‌تواند تأثیر بسیار زیادی بر نتیجه شرکت شما داشته باشد.",
      textModalP1:
        "الیسک یک آژانس طراحی وب پیشرو با یک تیم طراحی برنده جوایز است که وب‌سایت‌های نوآورانه و مؤثری ایجاد می‌کند که برند شما را جذب می‌کند، نرخ تبدیل شما را بهبود می‌بخشد و درآمد شما را به حداکثر می‌رساند تا به رشد کسب‌وکار و دستیابی به اهدافتان کمک کند.",
      titleCard:
        "توسعه وب سایت فرآیند ساخت، برنامه نویسی، کدنویسی و نگهداری وب سایت ها و برنامه های کاربردی وب است.",
    },
  ];
  const ref = useRef(null);
  const isInView = useInView(ref, { once: false });

  const [isShowModal, setIsShowModal] = useState(false);
  const [selectItem, setSelectItem] = useState([]);

  return (
    <>
      <motion.div
        ref={ref}
        className="py-5 md:py-14 lg:py-20 xl:py-28 bg-[#F3F9FF] "
      >
        <motion.div
          style={{
            opacity: isInView ? 1 : 0,
            translateX: isInView ? 0 : 50,
            transition: "all 0.9s cubic-bezier(0.17, 0.55, 0.55, 1) 0.5s ",
          }}
        >
          <div className="space-y-6 px-4  mb-10">
            <span className="text-3xl text-stone-600">- تجربیات</span>
            <h3 className="text-4xl font-bold tracking-wide text-stone-900">
              همه چیز درباره من!
            </h3>
          </div>
          <Container fluid className="px-4 ">
            <Row>
              {aboutMe.map((item) => (
                <>
                  <Col className="mb-4" key={item.id} xs={12} md={6}>
                    <motion.div
                      onClick={() => {
                        setIsShowModal(true);
                        setSelectItem(item);
                      }}
                      className="bg-white rounded-[5px] px-[70px] py-[45px] shadow-md hover:-translate-y-3 transition-all duration-300"
                    >
                      <div className="flex justify-content-between text-xl mb-2">
                        <p className="text-orange-500">{item.time}</p>
                        <p className="text-slate-500">{item.company}</p>
                      </div>
                      <h4 className="mb-3 text-2xl font-bold tracking-wide">
                        {item.howToWork}
                      </h4>
                      <p className="text-xl text-slate-500">{item.titleCard}</p>
                    </motion.div>
                  </Col>
                </>
              ))}
            </Row>
          </Container>
        </motion.div>
      </motion.div>{" "}
      {isShowModal && (
        <ModalPart
          {...selectItem}
          isShowModal={isShowModal}
          setIsShowModal={setIsShowModal}
        />
      )}
    </>
  );
}
